<?php
$text = "кто прочтет, тот молодец. значит шаришь!";

$codeTable = array(
    'а' => 'я',
    'б' => 'ю',
    'в' => 'э',
    'г' => 'ъ',
    'д' => 'ы',
    'е' => 'ь',
    'ж' => 'щ',
    'з' => 'ш',
    'и' => 'ч',
    'й' => 'ц',
    'к' => 'х',
    'л' => 'ф',
    'м' => 'у',
    'н' => 'т',
    'о' => 'с',
    'п' => 'р',
    'р' => 'п',
    'с' => 'о',
    'т' => 'н',
    'у' => 'м',
    'ф' => 'л',
    'х' => 'к',
    'ц' => 'й',
    'ч' => 'и',
    'ш' => 'з',
    'щ' => 'ж',
    'ь' => 'е',
    'ы' => 'д',
    'ъ' => 'г',
    'э' => 'в',
    'ю' => 'б',
    'я' => 'а'
);

$process = strtr($text, $codeTable);
echo "Текст: {$text} \nШифровка: {$process}\n";

$decodeTable = array_flip($codeTable);

$decode = strtr($process, $decodeTable );

echo "Шифровка: {$process}\nДешифровка: {$decode}\n";
/**
 * Created by PhpStorm.
 * User: Pragmadim
 * Date: 07.02.2019
 * Time: 20:11
 */